[X2DownloadableContentInfo_IRIRocketLaunchers]
RocketLaunchersWeaponCategory = "Rocket Launcher"
RocketsWeaponCategory = "Rocket"

[UIUtilities_LW]
;m_sAverageScatterText="± <XGParam:StrValue0/> Tiles"
m_sAverageScatterText1="Scatter: "
m_sAverageScatterText2=" Tiles"

[X2TargetingMethod_IRI_LWRocketLauncher]
strMaxScatter="\nMax Scatter (Tiles): "

[X2Ability_IRI_Rockets]
LockAndFireLockonName="Lock and Fire"

[IRI_FireRocket X2AbilityTemplate]
LocFriendlyName="Fire Rocket"
LocLongDescription="Fire the rocket from a rocket launcher. Rocket can scatter."
LocHelpText="Fire the rocket from a rocket launcher. Rocket can scatter."

[IRI_FireRocket_Spark X2AbilityTemplate]
LocFriendlyName="Fire Rocket"
LocLongDescription="Fire the rocket from a rocket launcher. Rocket can scatter."
LocHelpText="Fire the rocket from a rocket launcher. Rocket can scatter."


[IRI_X2Rocket_Standard X2RocketTemplate]
FriendlyName="Rocket: Standard"
FriendlyNamePlural="Standard Rockets"
BriefSummary="A typical rocket-propelled grenade with high-explosive yield, produced in massive quantities by the end of the 20th century. It relies on dated, but reliable technology and remains an effective weapon."
TacticalText="A typical rocket-propelled grenade with high-explosive yield, produced in massive quantities by the end of the 20th century. It relies on dated, but reliable technology and remains an effective weapon.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Standard Rocket"
ThrownAbilityHelpText="Fire a standard rocket at target area."
GiveRocketAbilityName="Give Standard Rocket"
GiveArmedRocketAbilityName="Give Armed Standard Rocket"
ArmRocketAbilityName="Arm Standard Rocket"
ArmRocketFlyover="Standard Rocket Armed"

[IRI_X2Rocket_Plasma X2RocketTemplate]
FriendlyName="Rocket: Plasma"
FriendlyNamePlural="Plasma Rockets"
BriefSummary="Desperate for any advantage, we took explosive charges from salvaged Alien Grenades and strapped them to a solid-fuel rocket engine. It's not pretty, but it's more powerful than conventional rockets."
TacticalText="Desperate for any advantage, we took explosive charges from salvaged Alien Grenades and strapped them to a solid-fuel rocket engine. It's not pretty, but it's more powerful than conventional rockets.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Plasma Rocket"
ThrownAbilityHelpText="Fire a plasma rocket at target area."
GiveRocketAbilityName="Give Plasma Rocket"
GiveArmedRocketAbilityName="Give Armed Plasma Rocket"
ArmRocketAbilityName="Arm Plasma Rocket"
ArmRocketFlyover="Plasma Rocket Armed"

[IRI_X2Rocket_Elerium X2RocketTemplate]
FriendlyName="Rocket: Elerium"
FriendlyNamePlural="Elerium Rockets"
BriefSummary="As we have discovered mostly by accident, subjecting an Elerium crystal to a modulated plasma beam generates a previously unobserved amount of raw explosive power. Unfortunately, the technology is too unstable to be used in anything other than heavy ordnance."
TacticalText="As we have discovered mostly by accident, subjecting an Elerium crystal to a modulated plasma beam generates a previously unobserved amount of raw explosive power. Unfortunately, the technology is too unstable to be used in anything other than heavy ordnance. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Elerium Rocket"
ThrownAbilityHelpText="Fire an elerium rocket at target area."
GiveRocketAbilityName="Give Elerium Rocket"
GiveArmedRocketAbilityName="Give Armed Elerium Rocket"
ArmRocketAbilityName="Arm Elerium Rocket"
ArmRocketFlyover="Elerium Rocket Armed"

[IRI_X2Rocket_Shredder X2RocketTemplate]
FriendlyName="Rocket: Shredder"
FriendlyNamePlural="Shredder Rockets"
BriefSummary="We managed to secure a large supply of these specialized rockets from one of the munitions depots left over from the original XCOM project. These rockets are highly effective at stripping off enemy armor and making them more vulnerable to follow-up damage."
TacticalText="We managed to secure a large supply of these specialized rockets from one of the munitions depots left over from the original XCOM project. These rockets are highly effective at stripping off enemy armor and making them more vulnerable to follow-up damage. <br/><Bullet/> Shredded targets take +33% more base damage from all sources.<br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Shredder Rocket"
ThrownAbilityHelpText="Fire a shredder rocket at target area."
GiveRocketAbilityName="Give Shredder Rocket"
GiveArmedRocketAbilityName="Give Armed Shredder Rocket"
ArmRocketAbilityName="Arm Shredder Rocket"
ArmRocketFlyover="Shredder Rocket Armed"

[IRI_X2Rocket_Shredder_T3 X2RocketTemplate]
FriendlyName="Rocket: Shredstorm"
FriendlyNamePlural="Shredstorm Rockets"
BriefSummary="An improved version of the Shredder rocket, the Shredstorm shears armor and destabilizes structural integrity of affected units, significantly increasing damage taken from other sources."
TacticalText="An improved version of the Shredder rocket, the Shredstorm shears armor and destabilizes structural integrity of affected units, significantly increasing damage taken from other sources <br/><Bullet/> Shredded targets take +50% more base damage from all sources.<br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Shredstorm Rocket"
ThrownAbilityHelpText="Fire a Shredstorm rocket at target area."
GiveRocketAbilityName="Give Shredstorm Rocket"
GiveArmedRocketAbilityName="Give Armed Shredstorm Rocket"
ArmRocketAbilityName="Arm Shredstorm Rocket"
ArmRocketFlyover="Shredstorm Rocket Armed"

[X2Rocket_Shredder]
ShredderEffectLocName="Shredded"
ShredderEffectLocDescription="This unit takes increased damage from all attacks."

[X2Effect_IRI_Shredded]
ShreddedFlyover="Shredded!"

[IRI_X2Rocket_Plasma_Ejector X2RocketTemplate]
FriendlyName="Plasma Ejector"
FriendlyNamePlural="Plasma Ejectors"
BriefSummary="This portable Elerium energy cell allows projecting a highly destructive beam of superheated plasma from one of our shoulder-mounted rocket launchers."
TacticalText="This portable Elerium energy cell allows projecting a highly destructive beam of superheated plasma from one of our shoulder-mounted rocket launchers. \n<Bullet/> Plasma Ejector deals a monstrous amount of damage and melts armor like it's nothing, but the plasma is highly unstable, and gets progressively weaker with distance and additional targets. \n<Bullet/> Plasma Ejector is most effective against priority targets at close range, or several weaker targets in a line. \n<Bullet/> Superheated plasma can destroy cover, but at the cost of dealing less damage to the target behind it, so it's preferable to minimize obstructions when possible. \n<Bullet/> Carrying a Plasma Ejector incurs a mobility penalty. \n<Bullet/> Plasma Ejectors can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Plasma Ejector"
ThrownAbilityHelpText="Fire a Plasma Ejector at target area."
GiveRocketAbilityName="Give Plasma Ejector"
GiveArmedRocketAbilityName="Give Armed Plasma Ejector"
ArmRocketAbilityName="Arm Plasma Ejector"
ArmRocketFlyover="Plasma Ejector Armed"

[IRI_X2Rocket_Lockon X2RocketTemplate]
FriendlyName="Rocket: Lockon"
FriendlyNamePlural="Lockon Rockets"
BriefSummary="This rocket uses a makeshift missile guidance system with repurposed GREMLIN AI algorithms to attack Holo-Targeted or robotic enemies. The guidance system occupies a lot of space, so we replaced most of the explosive yield with a shaped charge to focus damage on the primary target."
TacticalText="This rocket uses a makeshift missile guidance system with repurposed GREMLIN AI algorithms to attack Holo-Targeted or robotic enemies. The guidance system occupies a lot of space, so we replaced most of the explosive yield with a shaped charge to focus damage on the primary target. <br/><Bullet/> This rocket deals most of its damage to the primary target, piercing its armor. <br/><Bullet/> This rocket is fired against a single target, but it can potentially miss and hit something else. The chance to miss increases with distance when engaging enemies at Squadsight ranges. <br/><Bullet/> Carrying rockets incurs a mobility penalty.<br/><Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Lockon"
ThrownAbilityHelpText="Fire the lockon rocket at a target." 
GiveRocketAbilityName="Give Lockon Rocket"
GiveArmedRocketAbilityName="Give Armed Lockon Rocket"
ArmRocketAbilityName="Arm Lockon Rocket"
ArmRocketFlyover="Lockon Rocket Armed"

[X2Rocket_Lockon]
LockonDirectDamageString="DIRECT DAMAGE"
[X2Rocket_Lockon_T3]
LockonDirectDamageString="DIRECT DAMAGE"

[IRI_X2Rocket_Lockon_T3 X2RocketTemplate]
FriendlyName="Rocket: Falcon"
FriendlyNamePlural="Falcon Rockets"
BriefSummary="An improved version of the Lockon Rocket, Falcon carries a more powerful shaped charge warhead to further boost the damage dealt to the primary target. Splicing some fragmentation components to the rocket's hull has increased the damage and radius of the secondary explosion as well."
TacticalText="An improved version of the Lockon Rocket, Falcon carries a more powerful shaped charge warhead to further boost the damage dealt to the primary target. Splicing some fragmentation components to the rocket's hull has increased the damage and radius of the secondary explosion as well. <br/><Bullet/> This rocket deals most of its damage to the primary target, piercing its armor. <br/><Bullet/> This rocket is fired against a single target, but it can potentially miss and hit something else. The chance to miss increases with distance when engaging enemies at Squadsight ranges. <br/><Bullet/> Carrying rockets incurs a mobility penalty.<br/><Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Falcon Rocket"
ThrownAbilityHelpText="Fire the Falcon rocket at a target." 
GiveRocketAbilityName="Give Falcon Rocket"
GiveArmedRocketAbilityName="Give Armed Falcon Rocket"
ArmRocketAbilityName="Arm Falcon Rocket"
ArmRocketFlyover="Falcon Rocket Armed"

[IRI_X2Rocket_Napalm X2RocketTemplate]
FriendlyName="Rocket: Napalm"
FriendlyNamePlural="Napalm Rockets"
BriefSummary="This heavy rocket carries an extremely volatile mix of Napalm-B and jellied Elerium. Units lit on fire by this rocket will be forced to move, spreading fire to nearby objects and other units."
TacticalText="This heavy rocket carries an extremely volatile mix of Napalm-B and jellied Elerium. Units lit on fire by this rocket will be forced to move, spreading fire to nearby objects and other units. <br/><Bullet/> Fleeing enemies are easier to hit with reaction fire. <br/><Bullet/> Robotic and mechanical enemies are immune to this rocket's effects. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Napalm Rocket"
ThrownAbilityHelpText="Fire a napalm rocket at target area."
GiveRocketAbilityName="Give Napalm Rocket"
GiveArmedRocketAbilityName="Give Armed Napalm Rocket"
ArmRocketAbilityName="Arm Napalm Rocket"
ArmRocketFlyover="Napalm Rocket Armed"

[X2Rocket_Napalm]
WildfireEffectName="Wildfire"
WildfireEffectDescription="This unit is spreading fires as it moves around and it's easier to hit with reaction fire."

[IRI_X2Rocket_Napalm_T3 X2RocketTemplate]
FriendlyName="Rocket: Hellfire"
FriendlyNamePlural="Hellfire Rockets"
BriefSummary="A bigger and better version of the Napalm rocket with a few more highly flammable compounds added to the mix. Units lit on fire by this rocket will be forced to move, spreading fire to nearby objects and other units."
TacticalText="A bigger and better version of the Napalm rocket with a few more highly flammable compounds added to the mix. Units lit on fire by this rocket will be forced to move, spreading fire to nearby objects and other units. <br/><Bullet/> Fleeing enemies are easier to hit with reaction fire. <br/><Bullet/> Robotic and mechanical enemies are immune to this rocket's effects. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Hellfire Rocket"
ThrownAbilityHelpText="Fire a Hellfire rocket at target area."
GiveRocketAbilityName="Give Hellfire Rocket"
GiveArmedRocketAbilityName="Give Armed Hellfire Rocket"
ArmRocketAbilityName="Arm Hellfire Rocket"
ArmRocketFlyover="Hellfire Rocket Armed"

[IRI_X2Rocket_Sabot X2RocketTemplate]
FriendlyName="Rocket: Sabot"
FriendlyNamePlural="Sabot Rockets"
BriefSummary="With the rising threat of powerful Aliens and ADVENT units, we have developed an armor-piercing fin-stabilized discarding sabot alien alloy kinetic penetrator, designed to deal maximum damage to a single target."
TacticalText="With the rising threat of powerful Aliens and ADVENT units, we have developed an armor-piercing fin-stabilized discarding sabot alien alloy kinetic penetrator, designed to deal maximum damage to a single target. <br/><Bullet/> The Sabot projectile is fired against a single target, ignoring its cover and piercing its armor. <br/><Bullet/> The projectile is more likely to hit large targets, and more likely to deal critical damage to smaller targets. <br/><Bullet/> Biological enemies hit by Sabot will suffer bleeding. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Sabot"
ThrownAbilityHelpText="Fire a Sabot projectile at a target enemy."
GiveRocketAbilityName="Give Sabot Rocket"
GiveArmedRocketAbilityName="Give Armed Sabot Rocket"
ArmRocketAbilityName="Arm Sabot Rocket"
ArmRocketFlyover="Sabot Rocket Armed"

[IRI_X2Rocket_Sabot_T3 X2RocketTemplate]
FriendlyName="Rocket: Sabot H.I."
FriendlyNamePlural="Sabot Rockets"
BriefSummary="An improved version of the Sabot rocket, the High Impact variant of the kinetic penetrator is tempered in liquid elerium to ensure that it can withstand the impact pressure for longer. Otherwise, the velocity increase from the Elerium Launcher has no positive effect, and just causes the projectile to evaporate on impact."
TacticalText="An improved version of the Sabot rocket, the High Impact variant of the kinetic penetrator is tempered in liquid elerium to ensure that it can withstand the impact pressure for longer. Otherwise, the velocity increase from the Elerium Launcher has no positive effect, and just causes the projectile to evaporate on impact. <br/><Bullet/> The Sabot projectile is fired against a single target, ignoring its cover and piercing its armor. <br/><Bullet/> The projectile is more likely to hit large targets, and more likely to deal critical damage to smaller targets. <br/><Bullet/> Biological enemies hit by Sabot will suffer bleeding. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Sabot H.I."
ThrownAbilityHelpText="Fire a high impact Sabot projectile at a target enemy."
GiveRocketAbilityName="Give Sabot H.I. Rocket"
GiveArmedRocketAbilityName="Give Armed Sabot H.I. Rocket"
ArmRocketAbilityName="Arm Sabot H.I. Rocket"
ArmRocketFlyover="Sabot H.I. Rocket Armed"

[IRI_X2Rocket_Thermobaric X2RocketTemplate]
FriendlyName="Rocket: Thermobaric"
FriendlyNamePlural="Thermobaric Rockets"
BriefSummary="Thermobaric rocket disperses liquified Elerium and Alloy fragments, initiating a thermochemical reaction with oxygen in the atmosphere, resulting in a devastating volumetric explosion. It is extremely effective against environment objects and enemies in confined spaces, but ineffective against highly armored targets."
TacticalText="Thermobaric rocket disperses liquified Elerium and Alloy fragments, initiating a thermochemical reaction with oxygen in the atmosphere, resulting in a devastating volumetric explosion. It is extremely effective against environment objects and enemies in confined spaces, but ineffective against highly armored targets. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Thermobaric Rocket"
ThrownAbilityHelpText="Fire a theromobaric rocket at a target area."
GiveRocketAbilityName="Give Thermobaric Rocket"
GiveArmedRocketAbilityName="Give Armed Thermobaric Rocket"
ArmRocketAbilityName="Arm Thermobaric Rocket"
ArmRocketFlyover="Thermobaric Rocket Armed"

[IRI_X2Rocket_Thermobaric_T3 X2RocketTemplate]
FriendlyName="Rocket: Heatflash"
FriendlyNamePlural="Heatflash Rockets"
BriefSummary="An improved version of the Thermobaric rocket, the Heatflash rocket saturates the environment with a new kind of particle that rapidly forms polymer-like molecular bonds. For a brief moment, it makes the targeted area behave as if it is under water, allowing the subsequent thermobaric explosion deliver a hydrodynamic shock to all objects in the area, significantly boosting any potential damage."
TacticalText="An improved version of the Thermobaric rocket, the Heatflash rocket saturates the environment with a new kind of particle that rapidly forms polymer-like molecular bonds. For a brief moment, it makes the targeted area behave as if it is under water, allowing the subsequent thermobaric explosion deliver a hydrodynamic shock to all objects in the area, significantly boosting any potential damage.<br/><Bullet/> This rocket is extremely effective against environment objects and enemies in confined spaces, but ineffective against highly armored targets.<br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Heatflash Rocket"
ThrownAbilityHelpText="Fire a Heatflash rocket at a target area."
GiveRocketAbilityName="Give Heatflash Rocket"
GiveArmedRocketAbilityName="Give Armed Heatflash Rocket"
ArmRocketAbilityName="Arm Heatflash Rocket"
ArmRocketFlyover="Heatflash Rocket Armed"


[IRI_X2Rocket_WhitePh X2RocketTemplate]
FriendlyName="Rocket: Phosphorous"
FriendlyNamePlural="Phosphorous Rockets"
BriefSummary="This rocket disperses white phosphorus over a large area, poisoning enemies and inflicting severe burns, as well as covering the area with a cloud of toxic smoke."
TacticalText="This rocket disperses white phosphorus over a large area, poisoning enemies and inflicting severe burns, as well as covering the area with a cloud of toxic smoke. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Phosphorous Rocket"
ThrownAbilityHelpText="Fire a phosphorous rocket at a target area."
GiveRocketAbilityName="Give Phosphorous Rocket"
GiveArmedRocketAbilityName="Give Armed Phosphorous Rocket"
ArmRocketAbilityName="Arm Phosphorous Rocket"
ArmRocketFlyover="Phosphorous Rocket Armed"

[IRI_X2Rocket_WhitePh_T3 X2RocketTemplate]
FriendlyName="Rocket: Sarin"
FriendlyNamePlural="Sarin Rockets"
BriefSummary="We have improved the Phosphorous rocket by adding Sarin into the mix, an extremely toxic nerve agent. In addition to regular poison and burn effects, the initial blast of the rocket will inflict severe penalties on organic units."
TacticalText="We have improved the Phosphorous rocket by adding Sarin into the mix, an extremely toxic nerve agent. In addition to regular poison and burn effects, the initial blast of the rocket will inflict severe penalties on organic units. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Sarin Rocket"
ThrownAbilityHelpText="Fire a Sarin rocket at a target area."
GiveRocketAbilityName="Give Sarin Rocket"
GiveArmedRocketAbilityName="Give Armed Sarin Rocket"
ArmRocketAbilityName="Arm Sarin Rocket"
ArmRocketFlyover="Sarin Rocket Armed"

[IRI_X2Rocket_Acid X2RocketTemplate]
FriendlyName="Rocket: Acid"
FriendlyNamePlural="Acid Rockets"
BriefSummary="This rocket disperses a large amount of highly caustic acid that is a byproduct of processing Elerium. When affected units take actions or receive damage from other sources, they will also suffer additional damage from the acid."
TacticalText="This rocket disperses a large amount of highly caustic acid that is a byproduct of processing Elerium. When affected units take actions or receive damage from other sources, they will also suffer additional damage from the acid. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Acid Rocket"
ThrownAbilityHelpText="Fire an acid rocket at a target area."
GiveRocketAbilityName="Give Acid Rocket"
GiveArmedRocketAbilityName="Give Armed Acid Rocket"
ArmRocketAbilityName="Arm Acid Rocket"
ArmRocketFlyover="Acid Rocket Armed"

[IRI_X2Rocket_Flechette X2RocketTemplate]
FriendlyName="Rocket: Flechette"
FriendlyNamePlural="Flechette Rockets"
BriefSummary="This anti-personnel rocket disperses a rainstorm of razor-sharp alloy spikes over a large area. Spikes can be blocked by cover, and they are ineffective against armored targets."
TacticalText="This anti-personnel rocket disperses a rainstorm of razor-sharp alloy spikes over a large area. Spikes can be blocked by cover, and they are ineffective against armored targets. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Flechette Rocket"
ThrownAbilityHelpText="Fire a flechette rocket at a target area."
GiveRocketAbilityName="Give Flechette Rocket"
GiveArmedRocketAbilityName="Give Armed Flechette Rocket"
ArmRocketAbilityName="Arm Flechette Rocket"
ArmRocketFlyover="Flechette Rocket Armed"

[IRI_X2Rocket_Flechette_T3 X2RocketTemplate]
FriendlyName="Rocket: Metalstorm"
FriendlyNamePlural="Metalstorm Rockets"
BriefSummary="An improved version of the Flechette Rocket, Metalstorm rocket carries 50% larger yield of alloy spikes. This comes at no cost to other characteristics thanks to Elerium Launcher's increased power output. Spikes can be blocked by cover, and they are ineffective against armored targets."
TacticalText="An improved version of the Flechette Rocket, Metalstorm rocket carries 50% larger yield of alloy spikes. This comes at no cost to other characteristics thanks to Elerium Launcher's increased power output. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Metalstorm Rocket"
ThrownAbilityHelpText="Fire a Metalstorm rocket at a target area."
GiveRocketAbilityName="Give Metalstorm Rocket"
GiveArmedRocketAbilityName="Give Armed Metalstorm Rocket"
ArmRocketAbilityName="Arm Metalstorm Rocket"
ArmRocketFlyover="Metalstorm Rocket Armed"


[IRI_X2Rocket_Nuke X2RocketTemplate]
FriendlyName="Rocket: Nuke"
FriendlyNamePlural="Tactical Nukes"
BriefSummary="The Elerium Nuke is the most destructive tactical rocket in our arsenal. It relies on Refined Elerium detonation to jump start a Hydrogen fusion reaction, creating an explosion of immense power. Use it sparingly, Commander. We're trying to save the Earth, not turn it into a wasteland."
TacticalText="The Elerium Nuke is the most destructive tactical rocket in our arsenal. It relies on Refined Elerium detonation to jump start a Hydrogen fusion reaction, creating an explosion of immense power. Use it sparingly, Commander. We're trying to save the Earth, not turn it into a wasteland. <br/><Bullet/> Targets in the epicenter of the explosion take significantly more damage. <br/><Bullet/> Tactical Nuke has to be Armed before it can be fired. <br/><Bullet/> Once Armed, requires two actions to Fire. <br/><Bullet/> Once Armed, the Nuke cannot be Disarmed, and it will detonate automatically in 3 turns. <br/><Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Tactical Nuke"
ThrownAbilityHelpText="Fire a tactical elerium nuke at a target area."
GiveRocketAbilityName="Give Tactical Nuke"
GiveArmedRocketAbilityName="Give Armed Tactical Nuke"
ArmRocketAbilityName="Arm Tactical Nuke"
ArmRocketFlyover="Tactical Nuke Armed"

[X2Rocket_Nuke]
str_NukeIsArmed="TACTICAL NUKE ARMED"
str_NukeDetonationImminent="TACTICAL NUKE DETONATION IMMINENT"
str_NukeDetonation="TACTICAL NUKE DETONATION"

;	Unused below

[IRI_Rocket_Concussive X2RocketTemplate]
FriendlyName="Rocket: Concussive"
FriendlyNamePlural="Concussive Rockets"
BriefSummary="Promptly dubbed \"earthshaker\" by our troops, this rocket penetrates the ground and emits hypersonic soundwaves to create a miniature earthquake. While this rocket doesn't deal much damage to units or environment, it is effective at disorienting biological enemies, and can even render them unconscious."
TacticalText="<Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Concussive Rocket"
ThrownAbilityHelpText="Fire a concussive rocket at target area."
GiveRocketAbilityName="Give Concussive Rocket"

[IRI_Rocket_Cryo X2RocketTemplate]
FriendlyName="Rocket: Cryo"
FriendlyNamePlural="We have transformed our supply of Freeze Grenades to Cryo Rockets. Upon detonation, these rockets will freeze solid most targets. We speculate that the rapid shift in air temperature will create a persistent snowstorm that is likely to be difficult to traverse."
BriefSummary="A Cryo Rocket."
TacticalText="<Bullet/> Unlike grenades, most rockets can veer off and miss their target. Rocket scatter gets worse after moving or when taking long-distance shots. \n<Bullet/> Carrying rockets incurs a mobility penalty. \n<Bullet/> Rockets can be freely passed between soldiers during a mission."
ThrownAbilityname="Fire Cryo Rocket"
ThrownAbilityHelpText="Fire a Cryo rocket at target area."
GiveRocketAbilityName="Give Cryo Rocket"

[IRI_Rocket_BlackHole X2RocketTemplate]
FriendlyName="Black Hole Rocket"
FriendlyNamePlural="Black Hole Rockets"
BriefSummary="A Black Hole Rocket."
TacticalText="<Bullet/> A Black Hole Rocket."
ThrownAbilityname="Fire Black Hole Rocket"
ThrownAbilityHelpText="Fire a Black Hole rocket at target area."
GiveRocketAbilityName="Give Black Hole Rocket"
